my-test/MinVol/cavityGrade_проверка/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//------------------------------------------------------------------------------
// Минимальные допустимые значения (чем больше, тем лучше)
minDeterminant     1e-40;      // минимальный определитель матрицы Якоби (для неортогональных схем): 1 = гексагональная ячейка, <= 0 = сложенная или сплющенная недопустимая ячейка
minVolRatio        1e-2;      // минимальное отношение объёма ячейки к характерному объёму: до 1% от характерного объёма считается приемлемым
minTwist           0.02;      // минимальная «скрученность» грани (twist)
minFlatness        0.5;       // минимальная плоскостность грани
minFaceWeight      0.02;      // минимальный вес грани (для интерполяции) - Относительное положение грани относительно центров ячеек (0.5 для ортогональной сетки) 0 -> 0.5

// Пороговые углы (в градусах)
maxNonOrtho        70;         // максимальная неортогональность (выше — ошибка)
maxSkew            4;          // максимальная скошенность (выше — ошибка)
maxAspectRatio     50;       // максимальное аспектное отношение (длина/толщина)

// Допуски на долю плохих ячеек (если больше этого процента — считается ошибкой)
maxBadCellsPercent  0.1;         // макс. % ячеек с плохим качеством
maxBadFacesPercent   0.1;        // макс. % граней с плохим качеством
//------------------------------------------------------------------------------

//- Максимально допустимая асимметрия. Установите значение <0, чтобы отключить.
maxBoundarySkewness 20;
maxInternalSkewness 4;

maxConcave 80; // Установите значение 180, чтобы отключить.

minVol 1e-9; // Установите очень отрицательное число (например, -1e30), чтобы отключить или 1e-9 ячейки меньше 1 нм³ (условно)

minTetQuality 1e-15;

//- Минимальное скручивание грани. Установите значение <-1, чтобы отключить. Скалярное произведение нормали грани,
// и нормали треугольников центра грани
minTwist 0.02;

//- Минимальный нормализованный определитель ячейки. Это определитель всех,
// площадей внутренних граней. Это мера того, какая часть
// внешней площади ячейки относится к другим ячейкам. Идея заключается в том, что если все
// внешние грани ячейки «плавающие» (нулевой градиент), то
// «фиксированность» ячейки определяется площадью внутренних граней.

nSmoothScale 4;

errorReduction 0.75;

// ************************************************************************* //
// ************************************************************************* //
